var enterpriseChart = function (element)
{
    var myChart = echarts.init(element,'essos');

    // 指定图表的配置项和数据
    var option ={
  title: {
      text: "各城市企业数量"
  },
  tooltip: {
      trigger: "axis"
  },
  legend: {
      data: ["企业数"]
  },
  toolbox: {
      show: true,
      feature: {
          mark: {
              show: true
          },
          dataView: {
              show: true,
              readOnly: true
          },
          magicType: {
              show: false,
              type: ["line", "bar"]
          },
          restore: {
              show: true
          },
          saveAsImage: {
              show: true
          }
      }
  },
  calculable: true,
  xAxis: [
      {
          type: "category",
          data: ["北京市", "天津市", "石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市", "太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市", "呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市", "长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市", "上海市", "南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市", "淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市", "杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市", "合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "六安市", "亳州市", "池州市", "宣城市", "福州市", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市", "南昌市", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市", "济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "临沂市", "德州市", "聊城市", "滨州市", "菏泽市", "郑州市", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "信阳市", "周口市", "驻马店市", "武汉市", "黄石市", "十堰市", "宜昌市", "襄阳市", "鄂州市", "荆门市", "孝感市", "荆州市", "黄冈市", "咸宁市", "随州市", "长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "广州市", "韶关市", "深圳市", "珠海市", "汕头市", "佛山市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市", "南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市", "海口市", "三亚市", "儋州市", "重庆市", "成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "巴中市", "资阳市", "贵阳市", "六盘水市", "遵义市", "安顺市", "毕节市", "铜仁市", "昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "普洱市", "临沧市", "拉萨市", "日喀则市", "昌都市", "林芝市", "山南市", "那曲市", "西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市", "商洛市", "兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "张掖市", "平凉市", "酒泉市", "庆阳市", "定西市", "陇南市", "西宁市", "海东市", "银川市", "石嘴山市", "吴忠市", "固原市", "中卫市", "乌鲁木齐市", "克拉玛依市", "吐鲁番市", "哈密市"],
          nameTextStyle: {
              fontSize: 7
          }
      }
  ],
  yAxis: [
      {
          type: "value"
      }
  ],
  dataZoom: [
  {
    type: 'inside',
    start: 0,
    end: 10
  },
  {
    start: 0,
    end: 10
  }
],
  series: [
      {
          name: "企业数",
          type: "bar",
          itemStyle: {
            color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
                { offset: 0, color: '#ffe696' },
                { offset: 0.5, color: '#e89868' },
                { offset: 1, color: '#87626b' }
            ])
        },
          data: [3028, 5120, 2183, 1837, 429, 1435, 1554, 1645, 452, 399, 2100, 1222, 978, 622, 364, 221, 497, 425, 350, 806, 607, 478, 500, 588, 252, 460, 158, 271, 233, 458, 136, 264, 279, 1592, 1898, 707, 260, 223, 377, 338, 680, 210, 248, 304, 298, 323, 269, 1214, 425, 170, 104, 333, 159, 209, 156, 1196, 351, 208, 139, 152, 490, 63, 319, 102, 286, 115, 369, 8804, 3231, 7006, 2024, 5065, 11900, 5365, 985, 1486, 3139, 3039, 2011, 2861, 2065, 5992, 8571, 6724, 6364, 3792, 4561, 4629, 1131, 391, 4611, 1207, 2150, 1777, 1061, 723, 1134, 639, 493, 1644, 537, 1870, 1657, 1012, 1034, 617, 539, 1572, 2662, 2420, 1114, 1787, 5357, 2376, 958, 1151, 1045, 1553, 416, 609, 1985, 510, 389, 2332, 1662, 1896, 923, 1915, 2215, 3856, 1775, 739, 845, 2188, 3521, 1941, 1097, 1073, 797, 3421, 1496, 1436, 1316, 1908, 2295, 1092, 1785, 878, 779, 399, 1499, 848, 630, 1539, 559, 397, 1475, 1564, 1251, 1424, 1164, 2958, 704, 950, 1293, 1697, 492, 982, 1174, 1239, 1264, 945, 700, 2912, 1780, 1217, 1277, 1871, 1690, 1542, 223, 1290, 1186, 1199, 752, 1020, 6208, 504, 11255, 1492, 1928, 8020, 2535, 780, 751, 1281, 3055, 505, 258, 581, 390, 834, 11525, 3868, 939, 1397, 383, 1155, 1052, 518, 509, 279, 151, 338, 872, 633, 377, 270, 263, 267, 359, 173, 33, 25, 6938, 3664, 606, 373, 785, 1256, 1106, 543, 595, 414, 622, 806, 679, 868, 606, 891, 350, 321, 250, 764, 320, 738, 354, 387, 409, 997, 653, 428, 272, 145, 50, 166, 177, 85, 31, 7, 5, 17, 5, 1667, 196, 844, 725, 575, 276, 728, 1011, 764, 291, 371, 60, 102, 169, 163, 185, 184, 84, 233, 96, 118, 75, 224, 87, 365, 318, 339, 60, 158, 445, 97, 161, 148]
          ,animationDelay: function (idx) {
      return idx * 10 ;
    }
      }
  ],
  animationEasing: 'elasticOut',
animationDelayUpdate: function (idx) {
  return idx * 5;}
};

    // 使用刚指定的配置项和数据显示图表。
    myChart.setOption(option);
}