var salaryChart = function(element)
{
    var myChart = echarts.init(element,'essos');

      // 指定图表的配置项和数据
      var option ={
        title: {
            text: "平均工资"
        },
        tooltip: {
            trigger: "axis"
        },
        legend: {
            data: ["城镇非私营单位在岗职工平均工资(元)"]
        },
        toolbox: {
            show: true,
            feature: {
                mark: {
                    show: true
                },
                dataView: {
                    show: true,
                    readOnly: true
                },
                magicType: {
                    show: false,
                    type: ["line", "bar"]
                },
                restore: {
                    show: true
                },
                saveAsImage: {
                    show: true
                }
            }
        },
        calculable: true,
        xAxis: [
            {
                type: "category",
                boundaryGap: false,
                data: ["北京市", "天津市", "石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市", "太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市", "呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市", "长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市", "上海市", "南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市", "淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市", "杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市", "合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "六安市", "亳州市", "池州市", "宣城市", "福州市", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市", "南昌市", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市", "济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "临沂市", "德州市", "聊城市", "滨州市", "菏泽市", "郑州市", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "信阳市", "周口市", "驻马店市", "武汉市", "黄石市", "十堰市", "宜昌市", "襄阳市", "鄂州市", "荆门市", "孝感市", "荆州市", "黄冈市", "咸宁市", "随州市", "长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "广州市", "韶关市", "深圳市", "珠海市", "汕头市", "佛山市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市", "南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市", "海口市", "三亚市", "儋州市", "重庆市", "成都市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "雅安市", "巴中市", "资阳市", "贵阳市", "六盘水市", "遵义市", "安顺市", "毕节市", "铜仁市", "昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "普洱市", "临沧市", "拉萨市", "昌都市", "林芝市", "那曲市", "西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市", "商洛市", "兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "张掖市", "平凉市", "酒泉市", "庆阳市", "定西市", "陇南市", "西宁市", "海东市", "银川市", "石嘴山市", "吴忠市", "固原市", "中卫市", "乌鲁木齐市", "克拉玛依市", "吐鲁番市", "哈密市"]
            }
        ],
        yAxis: [
            {
                type: "value",
                name: "°C"
            }
        ],
        dataZoom: [
            {
                type: 'inside',
                start: 0,
                end: 10
            },
            {
                start: 0,
                end: 10
            }
        ],
        series: [
            {
                name: "城镇非私营单位在岗职工平均工资(元)",
                type: "line",
                itemStyle:
                {
                    color:"#ffd782"
                },
                data: [185026, 118918, 84870, 82483, 85609, 71148, 70311, 75635, 73958, 73929, 80905, 92653, 68819, 88650, 75145, 68077, 71306, 73443, 77091, 74469, 65317, 69414, 71121, 76906, 89549, 86333, 88270, 79912, 81558, 102903, 78803, 83608, 81305, 95908, 98812, 70993, 74909, 64857, 61537, 71400, 72505, 63670, 73390, 68858, 71582, 67895, 68269, 92905, 71733, 67134, 66603, 65126, 63022, 75817, 69606, 84796, 69460, 62287, 55114, 64267, 96088, 50319, 57737, 62859, 64465, 62944, 57631, 174678, 138005, 115748, 86138, 113273, 113744, 92542, 92008, 83216, 89727, 87874, 93129, 85944, 78697, 132188, 111286, 96775, 107614, 97620, 85837, 96589, 124605, 108495, 91307, 115583, 104818, 83593, 80102, 96671, 92490, 85560, 85332, 79459, 82877, 83281, 78062, 74188, 88247, 70775, 84912, 82058, 96478, 108554, 75316, 90508, 76330, 89060, 82487, 82970, 92223, 93774, 72319, 80056, 81455, 85324, 79399, 75085, 70103, 70644, 71861, 72108, 108391, 116115, 84758, 75428, 107271, 88339, 82085, 85437, 75073, 77022, 85886, 80594, 76721, 79960, 80233, 71449, 89464, 60758, 77000, 65272, 67048, 58297, 63509, 64602, 73100, 67237, 63931, 69767, 61104, 60509, 62036, 57587, 60574, 107567, 73486, 80481, 81053, 78512, 82032, 83218, 71857, 61734, 67847, 77732, 71143, 105603, 84738, 71074, 70240, 68987, 68050, 73745, 79586, 72492, 74129, 66641, 76055, 69412, 135138, 98366, 139436, 107284, 84400, 94536, 88219, 98028, 86586, 90002, 89840, 85160, 85628, 86494, 87212, 92883, 79601, 95309, 83437, 69943, 86847, 97079, 86155, 82096, 75836, 80132, 88304, 73822, 77986, 76079, 86362, 86858, 85292, 76582, 78189, 90277, 93152, 86970, 98380, 104463, 68716, 88437, 84222, 79873, 68864, 67573, 87663, 83013, 82096, 87304, 77965, 73449, 78205, 101829, 89001, 10216, 82795, 88442, 65278, 102304, 89052, 98139, 83733, 94947, 100632, 95620, 99755, 125998, 123660, 121361, 149738, 104363, 69120, 73028, 69290, 65596, 79799, 73316, 88461, 68251, 61124, 93847, 87807, 86195, 75745, 68500, 75582, 85779, 86228, 80752, 80521, 75289, 69164, 98369, 72108, 105653, 91602, 100167, 110060, 102042, 98907, 129545, 87678, 92265]
            }
        ]
    }
      // 使用刚指定的配置项和数据显示图表。
      myChart.setOption(option);
}